In [1]:
import pandas as pd
import numpy as np
import matplotlib as mlt

In [2]:
a={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(a)
df['State']='CA NV AZ'.split()
df.set_index('State',inplace=True)

In [3]:
df

         A    B  C
State
CA     1.0  5.0  1
NV     2.0  NaN  2
AZ     NaN  NaN  3

Fill NA

In [4]:
df.fillna(value='sudh')

          A     B  C
State
CA        1     5  1
NV        2  sudh  2
AZ     sudh  sudh  3

In [5]:
df.fillna(value='99')

        A   B  C
State
CA      1   5  1
NV      2  99  2
AZ     99  99  3

In [6]:
df.fillna(value=df['A'].mean())

         A    B  C
State
CA     1.0  5.0  1
NV     2.0  1.5  2
AZ     1.5  1.5  3

GroupBy operation

In [7]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [8]:
#finding average of sale based on company
by_company=df.groupby('Company')
print('Grouping based on company and then finding the sales average\n','-'*55,sep=' ')
print(by_company.mean())

Grouping based on company and then finding the sales average
 -------------------------------------------------------
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
#finding description based on companies
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [10]:
by_company=df.groupby('Company')
print('Grouping based on company and then finding the sales average\n','-'*55,sep=' ')
print(by_company.mean().loc[['MSFT','GOOG']])
print('\n','-'*55)
print(by_company.std().loc[['MSFT','GOOG']])

Grouping based on company and then finding the sales average
 -------------------------------------------------------
         Sales
Company
MSFT     232.0
GOOG     160.0

 -------------------------------------------------------
              Sales
Company
MSFT     152.735065
GOOG      56.568542

In [11]:
by_company.std().loc[['GOOG','FB']]

             Sales
Company
GOOG     56.568542
FB       75.660426

In [12]:
std_dev=by_company.std().loc[['MSFT','GOOG']]
std_dev

              Sales
Company
MSFT     152.735065
GOOG      56.568542

In [13]:
df.groupby('Company').describe().iloc[1:3,1:3]

         Sales
          mean         std
Company
GOOG     160.0   56.568542
MSFT     232.0  152.735065

In [14]:
df.iloc[1:5,0:3]

  Company   Person  Sales
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243

Extracting data from Sales column-cell 46 and 48 are same

In [45]:
df.groupby('Company').describe()['Sales']

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [46]:
df.groupby('Company').describe()['Sales'].iloc[1:3,0:3]

         count   mean         std
Company
GOOG       2.0  160.0   56.568542
MSFT       2.0  232.0  152.735065

In [48]:
df.groupby('Company').describe()['Sales'].loc[['GOOG','MSFT'],['count','mean','std']]

         count   mean         std
Company
GOOG       2.0  160.0   56.568542
MSFT       2.0  232.0  152.735065

Roatate the data

In [49]:
type(df.groupby('Company').describe())

pandas.core.frame.DataFrame

In [52]:
d=df.groupby('Company').describe()
df1=d.transpose()
df1

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

df1.iloc[0:3,0:2]

df1.loc[['Sales'],['FB','GOOG']]

In [88]:
df1.loc['Sales']
type(df1.loc['Sales'])

pandas.core.frame.DataFrame

In [96]:
df1.loc['Sales'].loc['mean']

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: mean, dtype: float64

In [95]:
df1.loc['Sales'].loc[['mean','std']]

Company          FB        GOOG        MSFT
mean     296.500000  160.000000  232.000000
std       75.660426   56.568542  152.735065

Finding std of google

Method-1

In [100]:
df.groupby('Company').describe().loc['GOOG'].iloc[2]

56.568542494923804

In [104]:
type(df.groupby('Company').describe().loc['GOOG']['Sales'])

pandas.core.series.Series

In [102]:
df.groupby('Company').describe().loc['GOOG']['Sales']['std']

56.568542494923804

In [112]:
#merging two data frame
#creating data frames
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [114]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
                index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [115]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
                index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Joining row wise

In [117]:
df_cat1=pd.concat([df1,df2,df3],axis=0)

In [118]:
df_cat1

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [121]:
df_cat1.loc[3]

A    A3
B    B3
C    C3
D    D3
Name: 3, dtype: object

Joing row but concentrate on indexes-

In [120]:
df4=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])
df5=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
                index=[0,1,2,3])
df6=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
                index=[0,1,2,3])
df_cont2=pd.concat([df4,df5,df6],axis=0)
df_cont2

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [122]:
df_cont2.loc[3]

     A    B    C    D
3   A3   B3   C3   D3
3   A7   B7   C7   D7
3  A11  B11  C11  D11

In [124]:
df_cont2.iloc[[3]]

    A   B   C   D
3  A3  B3  C3  D3

Joining df on col-wise axis=1

In [126]:
df4=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])
df5=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
                index=[4,5,6,7])
df6=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
                index=[8,9,10,11])
df_cont3=pd.concat([df4,df5,df6],axis=1)
df_cont3

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Joinf row on col-level with index=[0,1,2,3]

In [128]:
df4=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])
df5=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
                index=[0,1,2,3])
df6=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
                index=[0,1,2,3])
df_cont4=pd.concat([df4,df5,df6],axis=1)
df_cont4

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

Merge operation

In [10]:
left=pd.DataFrame({'key':['K0','K8','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [11]:
left

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [12]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [13]:
merge1=pd.merge(left,right,how='inner',on='key')

In [14]:
merge1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [21]:
df1=pd.DataFrame({'key1':['K0','K8','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
df2=pd.DataFrame({'key2':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [17]:
merge2=pd.merge(df1,df2,how='inner')

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [18]:
merge2=pd.merge(df1,df2,how='inner',left_on='key1',right_on='key2')

In [19]:
merge2

  key1   A   B key2   C   D
0   K0  A0  B0   K0  C0  D0
1   K1  A1  B1   K1  C1  D1
2   K2  A2  B2   K2  C2  D2
3   K3  A3  B3   K3  C3  D3

In [22]:
merge3=pd.merge(df1,df2,how='left',left_on='key1',right_on='key2')
merge3

  key1   A   B key2    C    D
0   K0  A0  B0   K0   C0   D0
1   K8  A1  B1  NaN  NaN  NaN
2   K2  A2  B2   K2   C2   D2
3   K3  A3  B3   K3   C3   D3

In [24]:
df3=pd.DataFrame({'key1':['K0','K8','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'C':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
df4=pd.DataFrame({'key2':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [25]:
merge4=pd.merge(df3,df4,how='left',left_on='key1',right_on='key2')
merge4

  key1   A C_x   B key2  C_y    D
0   K0  A0  A0  B0   K0   C0   D0
1   K8  A1  A1  B1  NaN  NaN  NaN
2   K2  A2  A2  B2   K2   C2   D2
3   K3  A3  A3  B3   K3   C3   D3

Join operation

In [28]:
left1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']},
                 index=['K0','K1','K2','K3'])
right1=pd.DataFrame({'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                index=['K0','K1','K2','K3'])

In [29]:
left1.join(right1)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

Example:
1.Concat(hori,vertically)
2.merge based on key using outer 
3.join based on outter

In [50]:
df_1=pd.DataFrame({'key1':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  
                  'B':['B0','B1','B2','B3']})
df_2=pd.DataFrame({'key2':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})
df_3=pd.DataFrame({'key3':['K0','K8','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'C':['A0','A1','A2','A3']})

In [58]:
df_concat_ex_1=pd.concat([df_1,df_2,df_3])
df_concat_ex_1

  key1    A    B key2    C    D key3
0   K0   A0   B0  NaN  NaN  NaN  NaN
1   K1   A1   B1  NaN  NaN  NaN  NaN
2   K2   A2   B2  NaN  NaN  NaN  NaN
3   K3   A3   B3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN   K0   C0   D0  NaN
1  NaN  NaN  NaN   K1   C1   D1  NaN
2  NaN  NaN  NaN   K2   C2   D2  NaN
3  NaN  NaN  NaN   K3   C3   D3  NaN
0  NaN   A0  NaN  NaN   A0  NaN   K0
1  NaN   A1  NaN  NaN   A1  NaN   K8
2  NaN   A2  NaN  NaN   A2  NaN   K2
3  NaN   A3  NaN  NaN   A3  NaN   K3

In [59]:
df_concat_ex_2=pd.concat([df_1,df_2,df_3],axis=1)
df_concat_ex_2

  key1   A   B key2   C   D key3   A   C
0   K0  A0  B0   K0  C0  D0   K0  A0  A0
1   K1  A1  B1   K1  C1  D1   K8  A1  A1
2   K2  A2  B2   K2  C2  D2   K2  A2  A2
3   K3  A3  B3   K3  C3  D3   K3  A3  A3

In [66]:
df_merge_ex=pd.merge(df_1,df_2,how='outer',left_on='key1',right_on='key2')
df_merge_ex

  key1   A   B key2   C   D
0   K0  A0  B0   K0  C0  D0
1   K1  A1  B1   K1  C1  D1
2   K2  A2  B2   K2  C2  D2
3   K3  A3  B3   K3  C3  D3